-*- mode: org; coding: utf-8-unix; fill-column: 80; mode: auto-fill; -*-

#+TITLE:   Notes on ob-asymptote
#+AUTHOR:  Mathieu Pouit
#+DATE:    2024-06-08

#+LANGUAGE:    en fr
# my shortcut or French writing:
# C-. …
# C-M ' «  »
# C- :   (insécable)
# M-': ’

#+STARTUP: showall
#+STARTUP: hidestars
#+STARTUP: noindent
#+STARTUP: inlineimages
#+STARTUP: latexpreview


** Getting an output from write command

[[https://asymptote.sourceforge.io/doc/index.html][Asymptote]] has an [[https://asymptote.sourceforge.io/doc/Interactive-mode.html][interactive]] mode and a [[https://asymptote.sourceforge.io/doc/Files.html#index-write][write]] command, that can be of some
interest under an Org notebook. This part is describing how this kind of output
has been generated.

To detect whether the user wants an image file or a text output, the variable
~out-file~ is checked.

The difficulty I faced is that asymptote is designed to write output in a file,
but not give it as a feedback. So one need to execute the command in a buffer
and then convert the output sent to another buffer into a string. The commande
~shell-command~ allow to execute the ~asy~ programme and to put the result of it in
buffer (and the second buffer is to retrieve error).

#+begin_src emacs-lisp :results value
(defun execute-asymptote-code (code)
  "Execute a code entered as a string and return the resulting string."
  (with-temp-buffer
    (shell-command (concat "asy -command '" code "'")
		   (current-buffer) (current-buffer))
    (buffer-string)))

(let ((asymptote-code "write(\"Hello World!\");"))
  (message "%s" (execute-asymptote-code asymptote-code)))
#+end_src

#+RESULTS:
: Hello World!


In our case the commande has been written to a temporary file. If we want to
simulate this, it would be like this.


#+begin_src emacs-lisp :results value
(defun execute-asymptote-code (code)
  "Execute a code entered as a string and return the resulting string."
  (let (in-file (org-babel-temp-file "asymptote-"))
    (with-temp-file in-file (insert
			     (org-babel-expand-body:generic
			      code nil
			      (org-babel-variable-assignments:asymptote nil))))
    (with-temp-buffer
      (shell-command (concat "asy " code in-file)
		     (current-buffer) (current-buffer))
      (buffer-string))))

(let ((asymptote-code "write(\"Hello World!\");"))
  (message "%s" (execute-asymptote-code asymptote-code)))
#+end_src






Testing if it works

#+begin_src asymptote :results output raw
write("Hello World!");
#+end_src





#+begin_src asymptote :results output raw
pair lst = (1, 2);
write(lst);
#+end_src

#+RESULTS:
[[file:(1,2)
]]




















#+begin_src bash
asy /tmp/babel-hFTyRb/asymptote-HMUh5d
#+end_src

#+RESULTS:
: Hello World!


#+begin_src emacs-lisp :results value

(setq cmd "asy /tmp/babel-hFTyRb/asymptote-HMUh5d")
(setq result (shell-command cmd))
#+end_src

#+RESULTS:
: 0

